practica1 2012-2013/ims.acceptFriendshipRequest.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ims="http://tempuri.org/ims.xsd">
 <SOAP-ENV:Body>
  <ims:acceptFriendshipRequest>
   <user></user>
   <friend-nick></friend-nick>
  </ims:acceptFriendshipRequest>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
